UIDGenerator/artillery.yaml
config:
  target: "http://192.168.64.13:32000"
  http:
    timeout: 1 # Responses have to be sent within 1 second or the request will be aborted


  phases:
    # Create 100 virtual users every second for 60 seconds
    - duration: 60 # seconds
      arrivalRate: 50 # virtual users
      name: "Warm up phase"

    - duration: 60 # seconds
      arrivalRate: 100 # virtual users
      name: "Load testing phase"

    - duration: 60 # seconds
      arrivalRate: 500 # virtual users
      name: "Stress testing phase"

scenarios:
  - name: 'Load test uid generation'
    flow:
      - get:
          url: "/amit"
          expect:
            - statusCode: 200